Tekla Open API Reference for Tekla Structures 2025
View.ViewAttributes.ViewPlaneDatumPointForElevations Property
 Defines whether the datum point for elevations is view plane based (true) or specified (false). When set to false, the value of DatumLevel is used. When set to true, DatumLevel will be set to 0.0.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool ViewPlaneDatumPointForElevations { get; set; }
Public Property ViewPlaneDatumPointForElevations As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
View.ViewAttributes Class
Tekla.Structures.Drawing Namespace